# Taps
tap 'caskroom/cask'

# Formulas
brew 'ccat'
brew 'cmake'
brew 'colordiff'
brew 'ctags'
brew 'editorconfig'
brew 'fasd'
brew 'ffind'
brew 'ghi'
brew 'git'
brew 'hub'
brew 'jq'
brew 'pandoc'
brew 'python'
brew 'python3'
brew 'ruby'
brew 'the_silver_searcher'
brew 'tree'
brew 'vim'

# Casks
cask 'basictex'
cask 'beardedspice'
cask 'crashplan'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'google-play-music-desktop-player'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'rescuetime'
cask 'skim'
cask 'spectacle'
cask 'wmail'

# Mac App Store
mas '1Password', id: 443987910
mas 'Amphetamine', id: 937984704
mas 'FreeChat for Facebook Messenger', id: 1077753332
mas 'Pixelmator', id: 407963104
mas 'Slack', id: 803453959
mas 'Twitter', id: 409789998
mas 'Writed', id: 973510001
mas 'Wunderlist', id: 410628904
mas 'Xcode', id: 497799835
