# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'

# Formulas
brew 'ack'
brew 'ccat'
brew 'cmake'
brew 'colordiff'
brew 'ctags'
brew 'editorconfig'
brew 'fasd'
brew 'ffind'
brew 'ghi'
brew 'git'
brew 'hub'
brew 'jq'
brew 'node'
brew 'pandoc'
brew 'python'
brew 'python3'
brew 'ruby'
brew 'tree'
brew 'vim'

# Casks
cask 'atom'
cask 'basictex'
cask 'beardedspice'
cask 'crashplan'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'dropbox'
cask 'flux'
cask 'github-desktop'
cask 'google-chrome'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'skim'
cask 'spectacle'

# Mac App Store
mas '1Password', id: 443987910
mas 'Slack', id: 803453959
mas 'Twitter', id: 409789998
mas 'Xcode', id: 497799835
