# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

# Formulas
brew 'bat'
brew 'cmake'
brew 'colordiff'
brew 'ctags'
brew 'fasd'
brew 'fd'
brew 'gh'
brew 'git'
brew 'hub'
brew 'jq'
brew 'mas'
brew 'python'
brew 'ripgrep'
brew 'ruby'
brew 'tree'
brew 'vim'

# Casks
cask 'dropbox'
cask 'github'
cask 'font-jetbrains-mono'
cask 'macdown'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'rectangle'

# Mac App Store
mas '1Password', id: 1333542190
mas 'Amphetamine', id: 937984704
mas 'DaisyDisk', id: 411643860
mas 'Hush', id: 1544743900
mas 'Ka-Block!', id: 1335413823
mas 'Keynote', id: 409183694
mas 'Messenger', id: 1480068668
mas 'Numbers', id: 409203825
mas 'Parcel', id: 639968404
mas 'Pages', id: 409201541
mas 'Pixelmator', id: 407963104
mas 'Reeder', id: 1449412482
mas 'Scenecuts', id: 1540491573
mas 'Screens', id: 446107677
mas 'Slack', id: 803453959
mas 'TripIt', id: 1475712010
mas 'Twitter', id: 1482454543
mas 'WhatsApp', id: 1147396723
mas 'Xcode', id: 497799835
